#### 级联操作
- pd.concat, pd.append

In [2]:
import  numpy as np
import pandas as pd
from pandas import DataFrame

- 匹配级联

In [6]:
df1 = DataFrame(data=np.random.randint(0, 100, size=(5, 3)), columns=['A', 'B', 'C'])
df2 = DataFrame(data=np.random.randint(0, 100, size=(5, 3)), columns=['A', 'D', 'C'])
df1

    A   B   C
0  36  84  94
1  88  41  54
2  58  65   5
3  27  95  60
4  61  90  26

In [7]:
df2

    A   D   C
0  44  65  49
1  70  37  99
2  62   0  66
3  68  40  29
4  56  78   3

In [9]:
pd.concat((df1, df2), axis=0)

    A     B   C     D
0  36  84.0  94   NaN
1  88  41.0  54   NaN
2  58  65.0   5   NaN
3  27  95.0  60   NaN
4  61  90.0  26   NaN
0  44   NaN  49  65.0
1  70   NaN  99  37.0
2  62   NaN  66   0.0
3  68   NaN  29  40.0
4  56   NaN   3  78.0

In [10]:
pd.concat((df1, df2), axis=0, join='inner')

    A   C
0  36  94
1  88  54
2  58   5
3  27  60
4  61  26
0  44  49
1  70  99
2  62  66
3  68  29
4  56   3

In [15]:
df3 = DataFrame(data=np.random.randint(0, 100, size=(5, 2)), columns=['A', 'B'])
pd.concat((df1, df3), axis=0)

    A   B     C
0  36  84  94.0
1  88  41  54.0
2  58  65   5.0
3  27  95  60.0
4  61  90  26.0
0  43  93   NaN
1  69  61   NaN
2   9  17   NaN
3  23  70   NaN
4  46  68   NaN

In [16]:
df1 = DataFrame({'employee': ['Bob', 'Jake', 'Lisa'],
                 'group': ['Accounting', 'Engineering', 'Engineering'],
                 })
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [17]:
df2 = DataFrame({'employee': ['Lisa', 'Bob', 'Jake'],
                 'hire_date': [2004, 2008, 2012],
                 })
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012

In [18]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004